
//Task_1

// let a = 1, b = 1, c, d;
// c = ++a;
// alert(c); // ответ: 2 выходит, так как здесь префиксный инкремент перед a которому присвоено начальное значение 1

// пример 2
// d = b++;
// alert(d); //ответ: 1, так как здесь постфиксный инкремент и в консоль возвращается значение до изменений


// пример 3
// c = 2 + ++a;
// alert(c); //ответ: 5 "с" присвооено "2" плюс "a" c унарным плюсом дает в сумме "5"



// пример 4
// d = 2 + b++;
// alert(d); //ответ: 4 так как  здесь d записан как 4 , а b не меняется потому что идет постфиксный инкремент
// alert(a); //3
// alert(b); //3